app/views/groups/my_group.html.erb

SELECT COUNT(*) FROM "group_members" WHERE "group_members"."group_id" = ?  [["group_id", 3]]
---
          <td class="td2"><%= link_to group.name, group_path(group.id) %></td>
          <td class="td3"><%= group.group_members.count %></td>