app/views/searches/search.html.erb

SELECT "groups".* FROM "groups" WHERE (name LIKE'%asdf%')
---
            <td class="td1">
              <% if group.group_type == "work_group" %>

SELECT COUNT(*) FROM "group_members" WHERE "group_members"."group_id" = ?  [["group_id", 1]]
---
            <td class="td2"><%= link_to group.name, group_path(group.id) %></td>
            <td class="td3"><%= group.group_members.count %></td>