app/controllers/contacts_controller.rb

  def new
    @contact = Contact.new
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @contact = Contact.new(contact_params)
    @contact.name = current_user.name
    @contact.email = current_user.email
    if @contact.save
---
INSERT INTO "contacts" ("name", "email", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "asdf"], ["email", "17931937sanzaka@gmail.com"], ["message", "asdf"], ["created_at", "2021-09-17 03:47:03.401321"], ["updated_at", "2021-09-17 03:47:03.401321"]]