app/controllers/entries_controller.rb

  def create
    # 送信者のid、ページのグループidを取得し、加入申請として保存
    entry = Entry.new(entry_params)
    entry.save!
---
INSERT INTO "entries" ("user_id", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["group_id", 1], ["created_at", "2021-09-12 04:06:51.348795"], ["updated_at", "2021-09-12 04:06:51.348795"]]

  def destroy
    # 申請却下、取り下げの場合はこちらを実行
    @entry = Entry.find_by(group_id: params[:group_id], id: params[:id])
    @entry.destroy
---
SELECT  "entries".* FROM "entries" WHERE "entries"."group_id" = ? AND "entries"."id" = ? LIMIT ?  [["group_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 1]]

  def index
    @entries = Entry.where(group_id: params[:group_id])
    @group = Group.find(params[:group_id])
---
SELECT "entries".* FROM "entries" WHERE "entries"."group_id" = ?  [["group_id", 2]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]