app/controllers/groups_controller.rb

  def show
    # 共通するインスタンス変数
    @group = Group.find(params[:id])
    @my_group_status = GroupMember.find_by(group_id: @group, user_id: current_user.id)
    @entry = Entry.new
    @direct_join = GroupMember.new

    # workグループ
    @target = Target.new
    @result = Result.new
    @today_targets = Target.where(group_id: @group.id, created_at: Time.zone.now.all_day)
    @today_my_target = Target.where(user_id: current_user.id, group_id: @group.id, created_at: Time.zone.now.all_day).count

    # グラフ部分
    @results = Result.where(group_id: @group.id, created_at: Time.zone.now.all_day).order(:achievement).last(7)


    # friendグループ
    @message = GroupMessage.new
    @messages = GroupMessage.where(group_id: @group.id)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "group_members".* FROM "group_members" WHERE "group_members"."group_id" = ? AND "group_members"."user_id" = ? LIMIT ?  [["group_id", 6], ["user_id", 2], ["LIMIT", 1]]
SELECT "targets".* FROM "targets" WHERE "targets"."group_id" = ? AND "targets"."created_at" BETWEEN ? AND ?  [["group_id", 1], ["created_at", "2021-09-14 00:00:00"], ["created_at", "2021-09-14 23:59:59.999999"]]
SELECT  "group_members".* FROM "group_members" WHERE "group_members"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "targets".* FROM "targets" WHERE "targets"."user_id" = ? AND "targets"."created_at" BETWEEN ? AND ?  [["user_id", 1], ["created_at", "2021-09-21 15:00:00"], ["created_at", "2021-09-22 14:59:59.999999"]]
SELECT COUNT(*) FROM "targets" WHERE "targets"."user_id" = ? AND "targets"."group_id" = ? AND "targets"."created_at" BETWEEN ? AND ?  [["user_id", 1], ["group_id", 1], ["created_at", "2021-09-21 15:00:00"], ["created_at", "2021-09-22 14:59:59.999999"]]
SELECT  "results".* FROM "results" WHERE "results"."group_id" = ? AND "results"."created_at" BETWEEN ? AND ? ORDER BY "results"."achievement" DESC LIMIT ?  [["group_id", 1], ["created_at", "2021-09-21 15:00:00"], ["created_at", "2021-09-22 14:59:59.999999"], ["LIMIT", 7]]
SELECT  "group_messages".* FROM "group_messages" WHERE "group_messages"."group_id" = ? LIMIT ?  [["group_id", 2], ["LIMIT", 11]]
SELECT  "targets".* FROM "targets" WHERE "targets"."group_id" = ? AND "targets"."created_at" BETWEEN ? AND ? LIMIT ?  [["group_id", 1], ["created_at", "2021-09-15 00:00:00"], ["created_at", "2021-09-15 23:59:59.999999"], ["LIMIT", 11]]

  def create
    @group = Group.new(group_params)
    if @group.save
      # グループ作成者をグループメンバーに含める処理
      @direct_join = GroupMember.new(group_member_params)
      @direct_join.user_id = current_user.id
      @direct_join.group_id = @group.id
      @direct_join.operation_right = 1
      @direct_join.save!
---
INSERT INTO "groups" ("name", "intro", "image_id", "group_type", "created_at", "updated_at", "direct_join") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "asdf"], ["intro", ""], ["image_id", nil], ["group_type", 1], ["created_at", "2021-09-22 05:44:55.816418"], ["updated_at", "2021-09-22 05:44:55.816418"], ["direct_join", 1]]
SELECT "group_members".* FROM "group_members" WHERE "group_members"."group_id" = ?  [["group_id", 1]]
INSERT INTO "group_members" ("user_id", "group_id", "created_at", "updated_at", "operation_right") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["group_id", 1], ["created_at", "2021-09-22 04:56:47.280474"], ["updated_at", "2021-09-22 04:56:47.280474"], ["operation_right", 1]]

  def update
    @group = Group.find(params[:id])
    if @group.update(group_params)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "groups" SET "image_id" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["image_id", "2bc622d15ed6f8f8cba75fb69e9740ae92dc39fe20006e12f2177946ecbe"], ["updated_at", "2021-09-19 09:30:22.230393"], ["id", 6]]

  def my_group
    @my_groups = current_user.groups
---
SELECT "groups".* FROM "groups" INNER JOIN "group_members" ON "groups"."id" = "group_members"."group_id" WHERE "group_members"."user_id" = ?  [["user_id", 3]]