app/controllers/groups_controller.rb

SELECT "results"."created_at", "results"."achievement" FROM "results" ORDER BY "results"."created_at" ASC
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    # 共通するインスタンス変数
    @my_group_status = @group.group_members.find_by(group_id: @group, user_id: current_user.id)
    @entry = Entry.new
    @direct_join = GroupMember.new

    # workグループ
    @target = Target.new
    @result = Result.new
    @today_targets = @group.targets.where(created_at: Time.zone.now.all_day).page(params[:page]).per(10)
    @today_my_target = @today_targets.where(user_id: current_user.id).count

    # グラフ部分(chart.js)
    graph_datas = @group.results.where(created_at: Time.zone.now.all_day).order(:achievement).last(7)
    # graph_datasの順で、下のラベルに名前を入力させるための処理
    graph_labels = []
    graph_datas.each do |g|
      user = User.find(g.user_id)

SELECT "group_messages".* FROM "group_messages" WHERE "group_messages"."group_id" = ?  [["group_id", 2]]
---

    # friendグループ
    @message = GroupMessage.new
    @messages = GroupMessage.where(group_id: @group.id).order(id: "desc").page(params[:page]).per(15)

SELECT "group_members".* FROM "group_members" WHERE "group_members"."group_id" = ?  [["group_id", 3]]
---
  def create
    @group = Group.new(group_params)
    if @group.save
      # グループ作成者をグループメンバーに含める処理
      @direct_join = GroupMember.new(group_member_params)
      @direct_join.user_id = current_user.id
      @direct_join.group_id = @group.id