app/controllers/group_messages_controller.rb

  def create
    group_message = GroupMessage.new(group_message_params)
    if group_message.save
---
INSERT INTO "group_messages" ("user_id", "group_id", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["group_id", 2], ["message", "adsfasdfasdf"], ["created_at", "2021-09-22 05:00:06.309232"], ["updated_at", "2021-09-22 05:00:06.309232"]]

  def destroy
    group_message = GroupMessage.find(params[:id])
    group_message.destroy
---
SELECT  "group_messages".* FROM "group_messages" WHERE "group_messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "group_messages" WHERE "group_messages"."id" = ?  [["id", 1]]