app/controllers/groups_controller.rb

INSERT INTO "groups" ("name", "intro", "image_id", "group_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "asdf"], ["intro", "asdf"], ["image_id", nil], ["group_type", 0], ["created_at", "2021-09-10 06:43:57.903269"], ["updated_at", "2021-09-10 06:43:57.903269"]]
---
  def create
    @group = Group.new(group_params)
    if @group.save

UPDATE "groups" SET "image_id" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["image_id", nil], ["updated_at", "2021-09-11 10:17:08.463114"], ["id", 2]]
---
  def update
    @group = Group.find(params[:id])
    @group.update(group_params)

DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 1]]
---
  def destroy
    @group = Group.find(params[:id])
    @group.destroy