app/controllers/group_members_controller.rb

  def create
    # 加入申請が承諾された場合の処理
    @group_member = GroupMember.new(group_member_params)
    @group_member.group_id = params[:group_id]
    @group_member.save

    # 加入申請が残らないように破棄
    entry = Entry.find_by(user_id: @group_member.user_id, group_id: params[:group_id])
    entry.destroy
---
INSERT INTO "group_members" ("user_id", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["group_id", 1], ["created_at", "2021-09-10 06:44:00.260110"], ["updated_at", "2021-09-10 06:44:00.260110"]]
SELECT  "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."group_id" = ? LIMIT ?  [["user_id", 1], ["group_id", 1], ["LIMIT", 1]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 2]]

  def destroy
    @group_member = GroupMember.find_by(user_id: params[:id], group_id: params[:group_id])
    @group_member.destroy
    group = Group.find(params[:group_id])
    # 退会処理でグループメンバーが０人になったら、グループ削除
    if group.group_members.count == 0
      group.destroy
---
SELECT  "group_members".* FROM "group_members" WHERE "group_members"."user_id" = ? AND "group_members"."group_id" = ? LIMIT ?  [["user_id", 1], ["group_id", 1], ["LIMIT", 1]]
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 3]]
DELETE FROM "group_members" WHERE "group_members"."id" = ?  [["id", 1]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT COUNT(*) FROM "group_members" WHERE "group_members"."group_id" = ?  [["group_id", 3]]

  def index
    @group_members = GroupMember.where(group_id: params[:group_id]).page(params[:page]).per(5)
---
SELECT "group_members".* FROM "group_members" WHERE "group_members"."group_id" = ?  [["group_id", 3]]

  def direct
    # グループへの加入申請が必要ない場合の処理
    @direct_join = GroupMember.new(group_member_params)
    @direct_join.user_id = current_user.id
    @direct_join.group_id = params[:group_id]
    @direct_join.save!
---
INSERT INTO "group_members" ("user_id", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["group_id", 2], ["created_at", "2021-09-17 09:21:46.581144"], ["updated_at", "2021-09-17 09:21:46.581144"]]