app/controllers/results_controller.rb

SELECT  "targets".* FROM "targets" WHERE "targets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @target = Target.find(params[:target_id])

SELECT  "targets".* FROM "targets" WHERE "targets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    @result = Result.find(params[:id])
    @target = Target.find(params[:target_id])