app/controllers/results_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "results".* FROM "results" WHERE "results"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "targets".* FROM "targets" WHERE "targets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "results" ("target_id", "achievement", "created_at", "updated_at", "user_id", "group_id") VALUES (?, ?, ?, ?, ?, ?)  [["target_id", 1], ["achievement", 100], ["created_at", "2021-09-21 11:44:17.033064"], ["updated_at", "2021-09-21 11:44:17.033064"], ["user_id", 1], ["group_id", 1]]
---
  def create
    group = Group.find(params[:group_id])
    target = group.targets.find_by(user_id: current_user.id, created_at: Time.zone.now.all_day)
    result = Result.new(result_params)
    result.target_id = target.id
    result.user_id = current_user.id
    result.group_id = group.id
    if result.save

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "results".* FROM "results" WHERE "results"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @group = Group.find(params[:group_id])
    @result = Result.find(params[:id])

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "results".* FROM "results" WHERE "results"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "results" SET "result_memo" = ?, "updated_at" = ? WHERE "results"."id" = ?  [["result_memo", "hgj,"], ["updated_at", "2021-09-21 11:44:21.603135"], ["id", 1]]
---
  def update
    @group = Group.find(params[:group_id])
    @result = Result.find(params[:id])
    if @result.update(result_params)