app/controllers/targets_controller.rb

INSERT INTO "targets" ("user_id", "group_id", "target_content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["group_id", 6], ["target_content", "asdf"], ["created_at", "2021-09-20 06:48:29.308637"], ["updated_at", "2021-09-20 06:48:29.308637"]]
---
  def create
    target = Target.new(target_params)
    target.user_id = current_user.id
    target.group_id = params[:group_id]
    if target.save

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "targets".* FROM "targets" WHERE "targets"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @group = Group.find(params[:group_id])
    @target = Target.find(params[:id])

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "targets".* FROM "targets" WHERE "targets"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "targets" SET "target_content" = ?, "updated_at" = ? WHERE "targets"."id" = ?  [["target_content", "丁寧な接客を目指す！落ち着いて対応できるように！!!"], ["updated_at", "2021-09-13 05:05:15.240875"], ["id", 2]]
---
  def update
    @group = Group.find(params[:group_id])
    @target = Target.find(params[:id])
    if @target.update(target_params)

SELECT  "targets".* FROM "targets" WHERE "targets"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "targets" WHERE "targets"."id" = ?  [["id", 4]]
---
  def destroy
    target = Target.find(params[:id])
    target.destroy