app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "intro" = ?, "image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["intro", "yuukidesu青；居sdjf；亜ジェrhんf；愛絵rんfじゃ；rんf；アンれf；イアr；いｇｊ"], ["image_id", nil], ["updated_at", "2021-09-20 06:43:18.994130"], ["id", 1]]
---
  def update
    @user = User.find(current_user.id)
    if @user.update(user_params)