app/models/group.rb

  def entry_exists?(user)
    self.entries.find_by(group_id: self.id, user_id: user.id)
---
SELECT  "entries".* FROM "entries" WHERE "entries"."group_id" = ? AND "entries"."group_id" = ? AND "entries"."user_id" = ? LIMIT ?  [["group_id", 1], ["group_id", 1], ["user_id", 3], ["LIMIT", 1]]