app/models/result.rb

  def self.chart_date
    order(created_at: :asc).pluck("created_at", "achievement").to_h
---
SELECT "results"."created_at", "results"."achievement" FROM "results" ORDER BY "results"."created_at" ASC