app/models/target.rb

SELECT  "results".* FROM "results" WHERE "results"."target_id" = ? LIMIT ?  [["target_id", 2], ["LIMIT", 1]]
---
  def achievement_by?(target)
    Result.find_by(target_id: target.id).present?

SELECT  "results".* FROM "results" WHERE "results"."result_memo" != ? AND "results"."target_id" = ? LIMIT ?  [["result_memo", ""], ["target_id", 2], ["LIMIT", 1]]
---
  def result_memo_exists?(target)
    Result.where.not(result_memo: nil || "").find_by(target_id: target.id).present?